ERP.belugaerp/src/Documents/ТТНИсходящаяЕГАИС/ТТНИсходящаяЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТТНИсходящаяЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>бг_ДатаФиксацииЕГАИС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_НомерФиксацииЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииДвижений</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПунктРазгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипТранспорта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИдентификаторЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕстьРасхождения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Справка2</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерСправки2Покупателя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/AccumulationRegisters/ОстаткиАлкогольнойПродукцииЕГАИС/ОстаткиАлкогольнойПродукцииЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ОстаткиАлкогольнойПродукцииЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>СвободныйОстаток</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ОрганизацияЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>АлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Справка2</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ДвижениеМарок/бг_ДвижениеМарок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ДвижениеМарок</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>КодУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>26</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусМарки</name>
    <type>
      <types>EnumRef.бг_СтатусыАкцизныхМарок</types>
    </type>
  </resources>
  <dimensions>
    <name>ГУИДМарки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/СтатусыДокументовЕГАИС/СтатусыДокументовЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДокументовЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДальнейшееДействие1</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДальнейшееДействие2</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДальнейшееДействие3</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ТранспортнаяИнформация/бг_ТранспортнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ТранспортнаяИнформация</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПунктНазначения</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорНаПеревозку</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорСубподряда</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВидПеревозки</name>
    <type>
      <types>CatalogRef.бг_ВидыПеревозки</types>
    </type>
  </resources>
  <resources>
    <name>ДоверенностьНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоверенностьДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоверенностьЧерез</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерЗаказа</name>
    <comment>Номер Заказа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомераПломб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ХранилищеДополнительныхСведений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеСведенийТНиСВ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаТН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>ПорядковыйНомерТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипВладенияТС</name>
    <type>
      <types>CatalogRef.бг_ТипыВладенияТС</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизаторПеревозки</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорНаВладение</name>
    <type>
      <types>CatalogRef.бг_ДоговорыВладенияТС</types>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоговорНаВладениеПрицеп</name>
    <type>
      <types>CatalogRef.бг_ДоговорыВладенияТС</types>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МыГрузимТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаДоставкиС</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаДоставкиПо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РучнаяКорректировкаДатыДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НомерКонтейнера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ЗаказНаПеремещение</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ОбъектыДляОтложеннойОбработки/бг_ОбъектыДляОтложеннойОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ОбъектыДляОтложеннойОбработки</name>
  <resources>
    <name>ДополнительныеСведения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.битОтражениеФактаПоПриходномуОрдеру</types>
      <types>DocumentRef.АктПостановкиНаБалансЕГАИС</types>
      <types>DocumentRef.ТТНВходящаяЕГАИС</types>
      <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.битПереупаковка</types>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
      <types>DocumentRef.битЗаявкаКлиента</types>
      <types>DocumentRef.ПриходныйОрдерНаТовары</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.битОтчетОбИмпортеПродукцииЕГАИС</types>
      <types>DocumentRef.битОтражениеФактаПоРасходномуОрдеру</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.битОтчетОПроизводствеЕГАИС</types>
      <types>DocumentRef.битМаршрутныйЛист</types>
      <types>CatalogRef.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВариантОбработки</name>
    <type>
      <types>EnumRef.бг_ВариантыОтложеннойОбработкиОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяРегистрации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РеестрДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>НомерПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>ТипСсылки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Documents/ТТНИсходящаяЕГАИС/ObjectModule.bsl
#Область ОбработчикиСобытий

&После("ОбработкаЗаполнения")
Процедура бг_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	бг_УстановитьТоварВПутиПринадлежитГрузополучателю(ДанныеЗаполнения);
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура бг_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	// Отправка данных на самого себя портит данные регистра Акцизные марки ЕГАИС
	Если Грузоотправитель = Грузополучатель Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Грузополучатель должен отличаться от грузоотправителя.';
				|en = 'Грузополучатель должен отличаться от грузоотправителя.'"),
			ЭтотОбъект,
			"Грузополучатель",,
			Отказ);
		
	КонецЕсли;
	
#Удаление
	Если Дата >= '20180701' Тогда
		АкцизныеМаркиЕГАИС.ПроверитьЗаполнениеАкцизныхМарокТТНИсходящейЕГАИС(ЭтотОбъект, Отказ);
	КонецЕсли;
#КонецУдаления
	
	ИнтеграцияЕГАИСПереопределяемый.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура бг_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	бг_ПроверитьЗаполнениеДатыОтгрузки(РежимЗаписи, Отказ);
	бг_ПроверитьВозможностьУдаленияПроведения(РежимЗаписи, Отказ);
	бг_ПроверитьЗаполнениеТранспортногоРаздела(РежимЗаписи, Отказ);

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура бг_ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	ИнтеграцияИС.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.ТТНИсходящаяЕГАИС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ИнтеграцияИС.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РегистрыНакопления.ОстаткиАлкогольнойПродукцииЕГАИС.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияИСПереопределяемый.ОтразитьДвиженияСерийТоваров(ДополнительныеСвойства, Движения, Отказ);
	
#Вставка	
	// Снимаем флаги автоматической записи, чтобы вызываемый ниже метод ИнтеграцияИС.ЗаписатьНаборыЗаписей()
	// не вызывал дополнительную запись пустых наборов регистров марок, которые лишний раз будут выгружаться в WMS. 
	Движения.бг_ДвижениеМарок.Записывать = Ложь;
	
	бг_ЗафиксироватьДатуНачисленияАкциза(Отказ);
#КонецВставки	
	
	ИнтеграцияИС.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ИнтеграцияЕГАИСПереопределяемый.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	ИнтеграцияИС.ОчиститьДополнительныеСвойстваДляПроведения(ЭтотОбъект.ДополнительныеСвойства);
	
#Вставка
	бг_ИнициализироватьДополнительныеСвойстваДляПроведенияПоМаркам();
	бг_СформироватьДвиженияПоМаркам(Отказ);
	бг_ОтразитьДополнительныеСведенияЗаказаКлиента(Отказ);
#КонецВставки
	
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура бг_ОбработкаУдаленияПроведения(Отказ)
	
	бг_ОтразитьДополнительныеСведенияЗаказаКлиента(Отказ);
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура бг_ПриЗаписи(Отказ)
	
	бг_СформироватьДвиженияПоРееструДокументов(Отказ, Ссылка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура бг_ЗафиксироватьДатуНачисленияАкциза(Отказ)
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(бг_ДатаФиксацииЕГАИС) Тогда 
		бг_СоздатьСправки2ПокупателяЗафиксироватьДатуНачисленияАкциза();
	КонецЕсли;
КонецПроцедуры

Процедура бг_СоздатьСправки2ПокупателяЗафиксироватьДатуНачисленияАкциза()
	ДатаНачисленияАкциза = бг_ДатаФиксацииЕГАИС;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	isnull(Справки2ЕГАИС.Ссылка, Неопределено) КАК Справка2Покупателя,
	|	ТТНИсходящаяЕГАИСТовары.Справка2 КАК Справка2,
	|	ЕСТЬNULL(ТТНИсходящаяЕГАИСТовары.Справка2.Справка1.Грузоотправитель.СоответствуетОрганизации, ЛОЖЬ) КАК УстанавливатьДату,
	|	ТТНИсходящаяЕГАИСТовары.Справка2.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ТТНИсходящаяЕГАИСТовары.Справка2.НомерСправки1 КАК НомерСправки1,
	|	ТТНИсходящаяЕГАИСТовары.Справка2.Справка1 КАК Справка1,
	|	ТТНИсходящаяЕГАИСТовары.Количество КАК Количество,
	|	ТТНИсходящаяЕГАИСТовары.Справка2.бг_ДатаНачисленияАкциза КАК бг_ДатаНачисленияАкциза,
	|	ТТНИсходящаяЕГАИСТовары.НомерСправки2Покупателя КАК РегистрационныйНомер,
	|	ТТНИсходящаяЕГАИСТовары.НомерСправки2Покупателя КАК Наименование
	|ИЗ
	|	Документ.ТТНИсходящаяЕГАИС.Товары КАК ТТНИсходящаяЕГАИСТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Справки2ЕГАИС КАК Справки2ЕГАИС
	|		ПО ТТНИсходящаяЕГАИСТовары.НомерСправки2Покупателя = Справки2ЕГАИС.РегистрационныйНомер
	|ГДЕ
	|	isnull(Справки2ЕГАИС.бг_ДатаНачисленияАкциза, ДатаВремя(1, 1, 1)) = ДатаВремя(1, 1, 1)
	|	И НЕ НомерСправки2Покупателя = """"";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	    Попытка
			Если ЗначениеЗаполнено(Выборка.Справка2Покупателя) Тогда
				Справка2Объект = Выборка.Справка2Покупателя.ПолучитьОбъект();
				ЗаполнитьЗначенияСвойств(Справка2Объект, Выборка, "бг_ДатаНачисленияАкциза");
			Иначе 
				Справка2Объект = Справочники.Справки2ЕГАИС.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(Справка2Объект, Выборка);
			КонецЕсли;
			Если Выборка.УстанавливатьДату и Не ЗначениеЗаполнено(Справка2Объект.бг_ДатаНачисленияАкциза) Тогда
				Справка2Объект.бг_ДатаНачисленияАкциза = ДатаНачисленияАкциза;
			КонецЕсли;        
			Справка2Объект.Записать();
		Исключение
			ТекстОшибки = НСтр("ru='Не удалось создать справку 2 покупателя %1 по причине %2'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, Выборка.РегистрационныйНомер, ОписаниеОшибки());
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура бг_ПроверитьЗаполнениеДатыОтгрузки(РежимЗаписи, Отказ)
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		Или ПометкаУдаления Тогда
		
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("адаптер_ЭтоЗагрузкаДанных")
		И ДополнительныеСвойства.адаптер_ЭтоЗагрузкаДанных = Истина Тогда
		
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаОтгрузки) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Не заполнена дата отгрузки'"), 
			ЭтотОбъект,
			"ДатаОтгрузки",
			, // ПутьКДанным
			Отказ);
			
	Иначе
			
		Если ЭтоНовый()
			И ЗначениеЗаполнено(ДатаОтгрузки)
			И НачалоДня(ДатаОтгрузки) < НачалоДня(ТекущаяДатаСеанса()) Тогда
			
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru='Дата отгрузки в создаваемой ТТН не должна быть меньше текущей даты.'"), 
				ЭтотОбъект,
				"ДатаОтгрузки",
				, // ПутьКДанным
				Отказ);
				
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура бг_ПроверитьВозможностьУдаленияПроведения(РежимЗаписи, Отказ)
	
	Если Не ЗначениеЗаполнено(Ссылка) Или Отказ Или РольДоступна("бг_КонтролерЕГАИС") Тогда
		Возврат;
	КонецЕсли;
	
	Если РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(Ссылка).Статус
		<> Перечисления.СтатусыОбработкиТТНИсходящейЕГАИС.Подтвержден Тогда

		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		Или ПометкаУдаления И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") Тогда
		
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru='У вас недостаточно прав на отмену подтвержденной ТТН.'"),,,, Отказ);
				
	КонецЕсли;

КонецПроцедуры

Процедура бг_ПроверитьЗаполнениеТранспортногоРаздела(РежимЗаписи, Отказ)
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		Или ПометкаУдаления Тогда		
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("адаптер_ЭтоЗагрузкаДанных")
		И ДополнительныеСвойства.адаптер_ЭтоЗагрузкаДанных = Истина Тогда 	
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Перевозчик)
			Или Не ЗначениеЗаполнено(Заказчик)
        			Или Не ЗначениеЗаполнено(ПунктПогрузки)
       	 		Или Не ЗначениеЗаполнено(ПунктРазгрузки) Тогда
          	
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Не вся транспортная информация указана'"), 
			ЭтотОбъект,,,
			Отказ);
			
	ИначеЕсли ТипТранспорта = ПредопределенноеЗначение("Перечисление.ТипыТранспортаЕГАИС.Автомобиль")
				И(Не ЗначениеЗаполнено(Водитель)
					Или Не ЗначениеЗаполнено(Заказчик)) Тогда
				
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Не вся транспортная информация указана'"), 
			ЭтотОбъект,,,
			Отказ);
			
	КонецЕсли;

КонецПроцедуры

Процедура бг_УстановитьТоварВПутиПринадлежитГрузополучателю(ДанныеЗаполнения)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.ЗаказКлиента) Тогда
		бг_УсловияПоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ДанныеЗаполнения.ЗаказКлиента,
			"бг_УсловияПоставки");
		Если ЗначениеЗаполнено(бг_УсловияПоставки) Тогда
			 ТоварВПутиПринадлежитГрузополучателюИзУсловийПоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				бг_УсловияПоставки,
				"ТоварВПутиПринадлежитГрузополучателю");
			Если ТоварВПутиПринадлежитГрузополучателюИзУсловийПоставки Тогда
             	ТоварВПутиПринадлежитГрузополучателю = ТоварВПутиПринадлежитГрузополучателюИзУсловийПоставки;
				Возврат;
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бг_ВидыПеревозки.Самовывоз КАК Самовывоз
	|ИЗ
	|	РегистрСведений.бг_ТранспортнаяИнформация КАК бг_ТранспортнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бг_ВидыПеревозки КАК бг_ВидыПеревозки
	|		ПО бг_ТранспортнаяИнформация.ВидПеревозки = бг_ВидыПеревозки.Ссылка
	|ГДЕ
	|	бг_ТранспортнаяИнформация.Объект = &Объект
	|	И бг_ВидыПеревозки.Самовывоз";
	
	Запрос.УстановитьПараметр("Объект", ДанныеЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		ТоварВПутиПринадлежитГрузополучателю = Истина;	
	КонецЕсли;
	
КонецПроцедуры

Процедура бг_ОтразитьДополнительныеСведенияЗаказаКлиента(Отказ)
	
	Если Отказ
		Или ДополнительныеСвойства.Свойство("бг_НеРегистрироватьПоказателиЗаказаКлиентаКОбновлению")
		И ДополнительныеСвойства.бг_НеРегистрироватьПоказателиЗаказаКлиентаКОбновлению = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		ЗаказКлиента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ЗаказКлиента");
		
		Если ЗначениеЗаполнено(ЗаказКлиента) Тогда
			РегистрыСведений.бг_ОбъектыДляОтложеннойОбработки.ДобавитьОбъект(
				ЗаказКлиента,
				Перечисления.бг_ВариантыОтложеннойОбработкиОбъектов.ОтразитьДополнительныеСведенияЗаказаКлиента,,
				Новый ХранилищеЗначения(
					РегистрыСведений.бг_ДополнительныеСведенияПоЗаказамКлиентов.ПоказателиПоТипуДокумента(Ссылка)));
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

#Область ДвиженияПоМаркам

Процедура бг_ИнициализироватьДополнительныеСвойстваДляПроведенияПоМаркам()

	// бг_ТекущийСтатус
	ТекущийСтатус = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(Ссылка).Статус;
	ДополнительныеСвойства.Вставить("бг_ТекущийСтатус",	ТекущийСтатус);
		
	// бг_ФормироватьДвиженияПоМаркам
	ФормироватьДвиженияПоМаркам	= бг_ИнтеграцияЕГАИСПовтИсп.ИспользоватьМеханизмДвиженийМарок(Ссылка);
	ДополнительныеСвойства.Вставить("бг_ФормироватьДвиженияПоМаркам", ФормироватьДвиженияПоМаркам);
	
КонецПроцедуры

Процедура бг_СформироватьДвиженияПоМаркам(Отказ)
	
	Если Отказ Или Не ДополнительныеСвойства.бг_ФормироватьДвиженияПоМаркам Тогда
		Возврат;
	КонецЕсли;

	Если Документы.ТТНИсходящаяЕГАИС.бг_СтатусДостаточныйДляФормированияМарок(ДополнительныеСвойства.бг_ТекущийСтатус) Тогда

		ДанныеОтгружаемыхШтрихкодов = Документы.ТТНИсходящаяЕГАИС.бг_ДанныеОтгружаемыхШтрихкодов(
			Ссылка,
			ДокументОснование,
			Ложь);
			
		бг_ПроверитьСоответствиеМарокТоварам(Отказ, ДанныеОтгружаемыхШтрихкодов);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Если ЕстьРасхождения Тогда
			НеподтвержденныеМарки = Документы.ТТНИсходящаяЕГАИС.НеподтвержденныеАкцизныеМарки(Ссылка);
		КонецЕсли;
		
		бг_ОтразитьДвиженияМарок(ДанныеОтгружаемыхШтрихкодов.Марки, НеподтвержденныеМарки);
		
	Иначе		
		
		Движения.бг_ДвижениеМарок.Очистить();
		Движения.бг_ДвижениеМарок.Записать();
		
	КонецЕсли;		
		
КонецПроцедуры

Процедура бг_ПроверитьСоответствиеМарокТоварам(Отказ, ДанныеОтгружаемыхШтрихкодов)
	
	Если ДанныеОтгружаемыхШтрихкодов = Неопределено Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Не найдены данные отгружаемых марок, проведение невозможно.'"),
			Ссылка,
			, // Поле
			, // ПутьКДаным
			Отказ);
			
		Возврат;	
	КонецЕсли;	
	
	Документы.ТТНИсходящаяЕГАИС.бг_МаркиСоответствуютАлкогольнойПродукцииТТН(
		ДанныеОтгружаемыхШтрихкодов.Марки,
		Ссылка,
		Отказ);	
		
КонецПроцедуры

Процедура бг_ОтразитьДвиженияМарок(Марки, НеподтвержденныеМарки)

	СтатусыМарокПоОперации = Перечисления.бг_СтатусыАкцизныхМарок.СтатусыПоОперации(Метаданные().Имя);
	СтатусОтгружаетсяОбработаноЕГАИС = СтатусыМарокПоОперации.СтатусОтгружаетсяОбработаноЕГАИС;
	СтатусМаркиВыбыла = СтатусыМарокПоОперации.СтатусВыбыла;
	СтатусМаркиОтгрузкаНеПодтверждена = СтатусыМарокПоОперации.СтатусОтгрузкаНеПодтверждена;
	
	ДатаДвиженияМарок = Документы.ТТНИсходящаяЕГАИС.бг_ДатаДвиженияМарок(
		Ссылка,
		ДокументОснование,
		Дата,
		ДатаРегистрацииДвижений);
	
	Для каждого СтрокаМарки Из Марки Цикл
		
		Запись = Движения.бг_ДвижениеМарок.Добавить();
		Запись.Период = ДатаДвиженияМарок;
		ЗаполнитьЗначенияСвойств(Запись, СтрокаМарки);
		
		Если ДополнительныеСвойства.бг_ТекущийСтатус = Перечисления.СтатусыОбработкиТТНИсходящейЕГАИС.ОбрабатываетсяКлиентом Тогда
			Запись.СтатусМарки = СтатусОтгружаетсяОбработаноЕГАИС;
		Иначе
			Если ЕстьРасхождения И НеподтвержденныеМарки.Получить(СтрокаМарки.ИдентификаторМарки) <> Неопределено Тогда
				Запись.СтатусМарки = СтатусМаркиОтгрузкаНеПодтверждена;
			Иначе
				Запись.СтатусМарки = СтатусМаркиВыбыла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Движения.бг_ДвижениеМарок.Записать();
	
КонецПроцедуры

#КонецОбласти // Конец ДвиженияПоМаркам

# Область ДвиженияПоРееструДокументов

Процедура бг_СформироватьДвиженияПоРееструДокументов(Отказ, Документ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТТНИсходящаяЕГАИС", Документ); 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТТНИсходящаяЕГАИС.Номер КАК Номер,
	|	ТТНИсходящаяЕГАИС.Дата КАК Дата,
	|	ТТНИсходящаяЕГАИС.Ссылка КАК Ссылка,
	|	ТТНИсходящаяЕГАИС.ДокументОснование.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТТНИсходящаяЕГАИС.ДокументОснование.Организация КАК Организация,
	|	ТТНИсходящаяЕГАИС.ДокументОснование.Подразделение КАК Подразделение,
	|	ТТНИсходящаяЕГАИС.ДокументОснование.Партнер КАК Партнер,
	|	ТТНИсходящаяЕГАИС.ДокументОснование.Склад КАК Склад,
	|	ТТНИсходящаяЕГАИС.ПометкаУдаления КАК ПометкаУдаления,
	|	ТТНИсходящаяЕГАИС.Проведен КАК Проведен,
	|	ТТНИсходящаяЕГАИС.ДокументОснование.Валюта КАК ДокументОснованиеВалюта,
	|	ТТНИсходящаяЕГАИС.ДокументОснование.СуммаДокумента КАК ДокументОснованиеСуммаДокумента
	|ПОМЕСТИТЬ ВТ_ТТНИсходящаяЕГАИС
	|ИЗ
	|	Документ.ТТНИсходящаяЕГАИС КАК ТТНИсходящаяЕГАИС
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка, 
    |   Склад
	|;  
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТТНИсходящаяЕГАИС.Номер КАК НомерДокументаИБ,
	|	ВТ_ТТНИсходящаяЕГАИС.Дата КАК ДатаДокументаИБ,
	|	ВТ_ТТНИсходящаяЕГАИС.Ссылка КАК Ссылка,
	|	ВТ_ТТНИсходящаяЕГАИС.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВТ_ТТНИсходящаяЕГАИС.Организация КАК Организация,
	|	ВТ_ТТНИсходящаяЕГАИС.Подразделение КАК Подразделение,
	|	ВТ_ТТНИсходящаяЕГАИС.Партнер КАК Партнер,
	|	КлючиРеестраДокументов.Ссылка КАК МестоХранения,
	|	ВТ_ТТНИсходящаяЕГАИС.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТ_ТТНИсходящаяЕГАИС.Проведен КАК Проведен,
	|	ВТ_ТТНИсходящаяЕГАИС.ДокументОснованиеВалюта КАК Валюта,
	|	ВТ_ТТНИсходящаяЕГАИС.ДокументОснованиеСуммаДокумента КАК Сумма
	|ИЗ
	|	ВТ_ТТНИсходящаяЕГАИС КАК ВТ_ТТНИсходящаяЕГАИС
	|		Внутреннее СОЕДИНЕНИЕ Справочник.КлючиРеестраДокументов КАК КлючиРеестраДокументов
	|		ПО (КлючиРеестраДокументов.Ключ = ВТ_ТТНИсходящаяЕГАИС.Склад)
	|ГДЕ
	|	ВТ_ТТНИсходящаяЕГАИС.Ссылка = &ТТНИсходящаяЕГАИС";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		
		РеквизитыДокумента = ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат)[0];
		НаборЗаписей = РегистрыСведений.РеестрДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Ссылка.Установить(Документ);  
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, РеквизитыДокумента);
		НоваяЗапись.ТипСсылки = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Документ)); 
		НаборЗаписей.Записать(Истина); 
		
	КонецЕсли;
 	
КонецПроцедуры

# КонецОбласти // Конец ДвиженияПоРееструДокументов  

#КонецОбласти
